<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Backend URL prefix
    |--------------------------------------------------------------------------
    | Название сегмента url, по кторому будет осуществляться доступ в админ
    | панель
    |
    */

    'url_prefix' => 'backend',

    /*
    |--------------------------------------------------------------------------
    | Filemanager
    |--------------------------------------------------------------------------
    |
    */
    'filemanager_disk' => 'public',


    /*
    |--------------------------------------------------------------------------
    |  Default date and time formats
    |--------------------------------------------------------------------------
    */
    'datetime_format' => 'd.m.Y H:i',
    'date_format'     => 'd.m.Y',
    'time_format'     => 'H:i',

    /*
    |--------------------------------------------------------------------------
    |  Framework themes
    |--------------------------------------------------------------------------
    | Список доступных тем
    |
    */
    'theme' => [
        'default' => env('SLEEPINGOWL_THEME', 'admin-lte'), // Тема используемая по умолчанию

        'themes' => [
            'admin-lte' => [
                'class' => SleepingOwl\Framework\Themes\AdminLteTheme::class,
                // 'logo' => '...', // Переопределение логотипа
                // 'logo_small' => '...' // Переопределение компактной версии логотипа
            ]
        ]
    ],
];